package org.itstep.modules.module09.home.task2;

/**
 * Задача #2
 * - Создать абстрактный класс Shape.
 * - В нем описать единственный абстрактный метод getArea();
 * - Унаследовать от Shape несколько других классов, например, Rectangle, Line, Circle.
 * - Переопределить в каждом классе метод toString таким образом, чтобы он возвращал строку с названием фигуры и её площадью
 * - Создать универсальный класс оболочку ShapeHolder, который может хранить в себе массив из 100 элементов
 * любого созданного вами типа (Rectangle, Line etc.). Так же ShapeHolder должен считать суммарную площадь переданных ему элементов.
 */
public class Task2 {
}
